098_Мастер_Ра_разработка/src/AccumulationRegisters/Рулоны/Рулоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Рулоны</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рулон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/AccumulationRegisters/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Материалы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/Documents/НарядНаПроизводство/НарядНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НарядНаПроизводство</name>
  <registerRecords>AccumulationRegister.Материалы</registerRecords>
  <registerRecords>AccumulationRegister.Рулоны</registerRecords>
  <registerRecords>InformationRegister.Наряды</registerRecords>
  <attributes>
    <name>ДатаВыполненияНаряда</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийНачЦеха</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалСписанВКЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечати</name>
    <type>
      <types>EnumRef.РежимыПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПечатиРезка</name>
    <type>
      <types>CatalogRef.РежимыПечатиРезка</types>
    </type>
  </attributes>
  <attributes>
    <name>Связан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаТарифа</name>
    <type>
      <types>EnumRef.СпособыРасчетаТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеЗадание</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФЗПцеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха1</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха2</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифЦеха3</name>
    <type>
      <types>CatalogRef.ТарифыЦеха</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеНаряды</name>
    <attributes>
      <name>Наряд</name>
      <type>
        <types>DocumentRef.НарядНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолИзрасходМатериала_МП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериала</name>
    <attributes>
      <name>КоличествоИзрасходованногоМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭкземпляров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерРулона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Печатник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходМатериала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаРулона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыРаботников</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФЗП_ПоТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопФЗП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/CommonModules/ДвиженияДокументов/Module.bsl
// @strict-types


Процедура ВыполнитьДвиженияРулоны(Наряд) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НарядНаПроизводствоРасходМатериала.НомерРулона КАК НомерРулона,
	|	НарядНаПроизводствоРасходМатериала.МатериалОсновы КАК МатериалОсновы,
	|	НарядНаПроизводствоРасходМатериала.РасходМатериала КАК РасходМатериала,
	|	НарядНаПроизводствоРасходМатериала.Ссылка КАК Регистратор,
	|	табРулоны.Материал КАК Материал
	|ИЗ
	|	Документ.НарядНаПроизводство.РасходМатериала КАК НарядНаПроизводствоРасходМатериала
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Рулоны.Рулон КАК Рулон,
	|			Рулоны.Материал КАК Материал
	|		ИЗ
	|			РегистрНакопления.Рулоны КАК Рулоны) КАК табРулоны
	|		ПО НарядНаПроизводствоРасходМатериала.НомерРулона = табРулоны.Рулон
	|ГДЕ
	|	НарядНаПроизводствоРасходМатериала.Ссылка В(&спНарядов)
	|	И НЕ НарядНаПроизводствоРасходМатериала.НомерРулона = """"";
	
	Если Наряд.Связан Тогда 
		Запрос.УстановитьПараметр("спНарядов", Наряд.СвязанныеНаряды.Выгрузить(,"Наряд"));
	Иначе 
		спНарядов =  Новый СписокЗначений;
		спНарядов.Добавить(Наряд);
		Запрос.УстановитьПараметр("спНарядов", спНарядов);
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
		
	НаборЗаписей = РегистрыНакопления.Рулоны.СоздатьНаборЗаписей();

	ВыборкаПоРегистратору = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПоРегистратору.СледующийПоЗначениюПоля("Регистратор") Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаПоРегистратору.Регистратор);
		Пока ВыборкаПоРегистратору.Следующий() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Период 			= ВыборкаПоРегистратору.Регистратор.дата;
			Запись.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Запись.Количество  		= ВыборкаПоРегистратору.РасходМатериала;
			Запись.МатериалОсновы	= ВыборкаПоРегистратору.МатериалОсновы; 
			Запись.Материал         = ВыборкаПоРегистратору.Материал;
			Запись.Регистратор 		= ВыборкаПоРегистратору.Регистратор;
			Запись.Рулон       		= ВыборкаПоРегистратору.НомерРулона;		
		КонецЦикла;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	КонецЦикла;
		
КонецПроцедуры	

Процедура ВыполнитьДвиженияМатериалы(Наряд) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НарядНаПроизводствоРасходМатериала.МатериалОсновы КАК МатериалОсновы,
	|	НарядНаПроизводствоРасходМатериала.РасходМатериала КАК РасходМатериала,
	|	НарядНаПроизводствоРасходМатериала.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.НарядНаПроизводство.РасходМатериала КАК НарядНаПроизводствоРасходМатериала
	|ГДЕ
	|	НарядНаПроизводствоРасходМатериала.Ссылка В(&спНарядов)
	|	И НарядНаПроизводствоРасходМатериала.НомерРулона = """"";
	
	Если Наряд.Связан Тогда 
		Запрос.УстановитьПараметр("спНарядов", Наряд.СвязанныеНаряды.Выгрузить(,"Наряд"));
	Иначе 
		спНарядов =  Новый СписокЗначений;
		спНарядов.Добавить(Наряд);
		Запрос.УстановитьПараметр("спНарядов", спНарядов);
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
		
	НаборЗаписей = РегистрыНакопления.Материалы.СоздатьНаборЗаписей();

	ВыборкаПоРегистратору = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПоРегистратору.СледующийПоЗначениюПоля("Регистратор") Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаПоРегистратору.Регистратор);
		Пока ВыборкаПоРегистратору.Следующий() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Период 			= ВыборкаПоРегистратору.Регистратор.дата;
			Запись.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Запись.Количество  		= ВыборкаПоРегистратору.РасходМатериала;
			Запись.МатериалОсновы	= ВыборкаПоРегистратору.МатериалОсновы; 
			//Запись.Материал         = ВыборкаПоРегистратору.Материал;
			Запись.Регистратор 		= ВыборкаПоРегистратору.Регистратор;		
		КонецЦикла;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	КонецЦикла;
		
КонецПроцедуры	

Процедура ВыполнитьДвиженияНаряды(Ссылка) Экспорт 
	
КонецПроцедуры
